zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_gpio.h
#define  GPIO_MODE_IT_RISING                    GPIO_EXTI2_IT_RISING
#define  GPIO_MODE_IT_FALLING                   GPIO_EXTI2_IT_FALLING
#define  GPIO_MODE_IT_RISING_FALLING            GPIO_EXTI2_IT_RISING_FALLING
#define  GPIO_MODE_EVT_RISING                   GPIO_EXTI2_EVT_RISING
#define  GPIO_MODE_EVT_FALLING                  GPIO_EXTI2_EVT_FALLING
#define  GPIO_MODE_EVT_RISING_FALLING           GPIO_EXTI2_EVT_RISING_FALLING

/**
  * @}
  */

/** @defgroup GPIO_speed GPIO speed
  * @brief GPIO Output Maximum frequency
  * @{
  */
#define  GPIO_SPEED_FREQ_LOW        (0x00000000U)  /*!< Low speed       */
#define  GPIO_SPEED_FREQ_MEDIUM     (0x00000001U)  /*!< Medium speed    */
#define  GPIO_SPEED_FREQ_HIGH       (0x00000002U)  /*!< High speed      */
#define  GPIO_SPEED_FREQ_VERY_HIGH  (0x00000003U)  /*!< Very high speed */
/**
  * @}
  */

/** @defgroup GPIO_pull GPIO pull
  * @brief GPIO Pull-Up or Pull-Down Activation
  * @{
  */
#define  GPIO_NOPULL        (0x00000000U)   /*!< No Pull-up or Pull-down activation  */
#define  GPIO_PULLUP        (0x00000001U)   /*!< Pull-up activation                  */
#define  GPIO_PULLDOWN      (0x00000002U)   /*!< Pull-down activation                */
/**
  * @}
  */

/** @defgroup GPIO_attributes GPIO attributes
  * @brief GPIO pin secure/non-secure  or/and privilege/non-privilege or/end CID attributes
  * @{
  */
#define GPIO_PIN_ATTR_PRIV_SELECT          0x01000000U
#define GPIO_PIN_ATTR_SEC_SELECT           0x02000000U
#define GPIO_PIN_ATTR_CID_SHARED_MASK      (GPIO_CIDCFGR0_SEMWLC3 |\
                                            GPIO_CIDCFGR0_SEMWLC2 | GPIO_CIDCFGR0_SEMWLC1 | GPIO_CIDCFGR0_SEMWLC0)
#define GPIO_PIN_ATTR_CID_SHARED_SELECT    0x10000000U
#define GPIO_PIN_ATTR_CID_STATIC_SELECT    0x20000000U
#define GPIO_PIN_CID_DISABLE               0x80000000U

#define GPIO_PIN_PRIV_VAL_Pos             0
#define GPIO_PIN_PRIV                     (GPIO_PIN_ATTR_PRIV_SELECT | (1U<<GPIO_PIN_PRIV_VAL_Pos))     /*!< Pin is privileged             */
#define GPIO_PIN_NPRIV                    (GPIO_PIN_ATTR_PRIV_SELECT)                                   /*!< Pin is unprivileged           */

#if defined (CORTEX_IN_SECURE_STATE)
#define GPIO_PIN_SEC_VAL_Pos              1
#define GPIO_PIN_SEC                      (GPIO_PIN_ATTR_SEC_SELECT | (1U<<GPIO_PIN_SEC_VAL_Pos))      /*!< Pin is secure                 */
#define GPIO_PIN_NSEC                     (GPIO_PIN_ATTR_SEC_SELECT)              /*!< Pin is non-secure             */
#endif /* __ARM_SECURE_STATE */

#define GPIO_PIN_CID_SHARED_0                   (GPIO_PIN_ATTR_CID_SHARED_SELECT | GPIO_CIDCFGR0_SEMWLC0)      /*!< Enable CID filtering (shared mode) and give pin control  to CID0 */
#define GPIO_PIN_CID_SHARED_1                   (GPIO_PIN_ATTR_CID_SHARED_SELECT | GPIO_CIDCFGR0_SEMWLC1)      /*!< Enable CID filtering (shared mode) and give pin control  to CID1 */
#define GPIO_PIN_CID_SHARED_2                   (GPIO_PIN_ATTR_CID_SHARED_SELECT | GPIO_CIDCFGR0_SEMWLC2)      /*!< Enable CID filtering (shared mode) and give pin control  to CID2 */
#define GPIO_PIN_CID_SHARED_3                   (GPIO_PIN_ATTR_CID_SHARED_SELECT | GPIO_CIDCFGR0_SEMWLC3)      /*!< Enable CID filtering (shared mode) and give pin control  to CID3 */

#define GPIO_PIN_CID_STATIC_0                   (GPIO_PIN_ATTR_CID_STATIC_SELECT|(0<<GPIO_CIDCFGR0_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID0 */
#define GPIO_PIN_CID_STATIC_1                   (GPIO_PIN_ATTR_CID_STATIC_SELECT|(1<<GPIO_CIDCFGR0_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID1 */
#define GPIO_PIN_CID_STATIC_2                   (GPIO_PIN_ATTR_CID_STATIC_SELECT|(2<<GPIO_CIDCFGR0_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID2 */
#define GPIO_PIN_CID_STATIC_3                   (GPIO_PIN_ATTR_CID_STATIC_SELECT|(3<<GPIO_CIDCFGR0_SCID_Pos))   /*!< Enable CID filtering (static mode) and give pin control  to CID3 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Macros GPIO Exported Macros
  * @{
  */

/**
  * @brief  Check whether the specified EXTI line flag is set or not.
  * @param __EXTI_LINE__ specifies the EXTI line flag to check.
  *         This parameter can be GPIO_PIN_x where x can be(0..15)
  * @retval The new state of __EXTI_LINE__ (SET or RESET).
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_GET_FLAG(__EXTI_LINE__)       (EXTI1->PR1 & (__EXTI_LINE__))
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_GET_FLAG(__EXTI_LINE__)       (EXTI2->PR1 & (__EXTI_LINE__))

/**
  * @brief  Clear the EXTI's line pending flags.
  * @param __EXTI_LINE__ specifies the EXTI lines flags to clear.
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15)
  * @retval None
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_CLEAR_FLAG(__EXTI_LINE__)     (EXTI1->PR1 = (__EXTI_LINE__))
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_CLEAR_FLAG(__EXTI_LINE__)     (EXTI2->PR1 = (__EXTI_LINE__))

/**
  * @brief  Checks whether the specified EXTI line is asserted or not for Rising edge.

  * @param  __EXTI_LINE__: specifies the EXTI line to check.
  *          This parameter can be GPIO_PIN_x where x can be(0..15)
  * @retval The new state of __EXTI_LINE__ (SET or RESET).
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_GET_RISING_IT(__EXTI_LINE__) (EXTI1->RPR1 & (__EXTI_LINE__))
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_GET_RISING_IT(__EXTI_LINE__) (EXTI2->RPR1 & (__EXTI_LINE__))

/**
  * @brief  Checks whether the specified EXTI line is asserted or not for Falling edge.

  * @param  __EXTI_LINE__: specifies the EXTI line to check.
  *          This parameter can be GPIO_PIN_x where x can be(0..15)
  * @retval The new state of __EXTI_LINE__ (SET or RESET).
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_GET_FALLING_IT(__EXTI_LINE__) (EXTI1->FPR1 & (__EXTI_LINE__))
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_GET_FALLING_IT(__EXTI_LINE__) (EXTI2->FPR1 & (__EXTI_LINE__))

/**
  * @brief  Clears the EXTI's line pending bits for Risng edge.
  * @param  __EXTI_LINE__: specifies the EXTI lines to clear.
  *          This parameter can be any combination of GPIO_PIN_x where x can be (0..15)
  * @retval None
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_CLEAR_RISING_IT(__EXTI_LINE__) do { \
                                                             EXTI1->RPR1 = (__EXTI_LINE__); \
                                                           } while (0);
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_CLEAR_RISING_IT(__EXTI_LINE__) do { \
                                                            EXTI2->RPR1 = (__EXTI_LINE__); \
                                                          } while (0);

/**
  * @brief  Clears the EXTI's line pending bits for Falling edge.
  * @param  __EXTI_LINE__: specifies the EXTI lines to clear.
  *          This parameter can be any combination of GPIO_PIN_x where x can be (0..15)
  * @retval None
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_CLEAR_FALLING_IT(__EXTI_LINE__) do { \
                                                              EXTI1->FPR1 = (__EXTI_LINE__); \
                                                            } while (0);
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_CLEAR_FALLING_IT(__EXTI_LINE__) do { \
                                                             EXTI2->FPR1 = (__EXTI_LINE__); \
                                                           } while (0);

/**
  * @brief  Generate a Software interrupt on selected EXTI line.
  * @param __EXTI_LINE__ specifies the EXTI line to check.
  *          This parameter can be GPIO_PIN_x where x can be(0..15)
  * @retval None
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_GPIO_EXTI1_GENERATE_SWIT(__EXTI_LINE__)  (EXTI1->SWIER1 |= (__EXTI_LINE__))
#endif /*!defined(CORE_CM0PLUS)*/
#define __HAL_GPIO_EXTI_GENERATE_SWIT(__EXTI_LINE__)  (EXTI2->SWIER1 |= (__EXTI_LINE__))

/**
  * @}
  */

