zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_gpio.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup GPIO_Private_Macros GPIO Private Macros
  * @{
  */
#define IS_GPIO_PIN_ACTION(ACTION)  (((ACTION) == GPIO_PIN_RESET) || ((ACTION) == GPIO_PIN_SET))

#define IS_GPIO_PIN(__PIN__)        ((((uint32_t)(__PIN__) & GPIO_PIN_MASK) != 0x00U) &&\
                                     (((uint32_t)(__PIN__) & ~GPIO_PIN_MASK) == 0x00U))

#define IS_GPIO_COMMON_PIN(__RESETMASK__, __SETMASK__)  \
  (((uint32_t)(__RESETMASK__) & (uint32_t)(__SETMASK__)) == 0x00u)
#if !defined(CORE_CA35)
#define IS_GPIO_EXTI2_EVT(__MODE__) (((__MODE__) == GPIO_EXTI2_EVT_RISING)         ||\
                                     ((__MODE__) == GPIO_EXTI2_EVT_FALLING)        ||\
                                     ((__MODE__) == GPIO_EXTI2_EVT_RISING_FALLING  ))
#else   /* !defined(CORE_CA35) */
#define IS_GPIO_EXTI2_EVT(__MODE__)   (0U)
#endif  /* !defined(CORE_CA35) */

#if defined(CORE_CM33)
#define IS_GPIO_EXTI1_EVT(__MODE__) (((__MODE__) == GPIO_EXTI1_EVT_RISING)         ||\
                                     ((__MODE__) == GPIO_EXTI1_EVT_FALLING)        ||\
                                     ((__MODE__) == GPIO_EXTI1_EVT_RISING_FALLING  ))
#else   /* CORE_CM33 */
#define IS_GPIO_EXTI1_EVT(__MODE__)   (0U)
#endif  /* CORE_CM33 */

#define IS_GPIO_MODE(__MODE__)     ( \
                                     ( \
                                       ((__MODE__) == GPIO_MODE_INPUT)               ||   \
                                       ((__MODE__) == GPIO_MODE_OUTPUT_PP)           ||   \
                                       ((__MODE__) == GPIO_MODE_OUTPUT_OD)           ||   \
                                       ((__MODE__) == GPIO_MODE_AF_PP)               ||   \
                                       ((__MODE__) == GPIO_MODE_AF_OD)               ||   \
                                       ((__MODE__) == GPIO_EXTI1_IT_RISING)          ||   \
                                       ((__MODE__) == GPIO_EXTI1_IT_FALLING)         ||   \
                                       ((__MODE__) == GPIO_EXTI1_IT_RISING_FALLING)  ||   \
                                       ((__MODE__) == GPIO_EXTI2_IT_RISING)          ||   \
                                       ((__MODE__) == GPIO_EXTI2_IT_FALLING)         ||   \
                                       ((__MODE__) == GPIO_EXTI2_IT_RISING_FALLING)  ||   \
                                       ((__MODE__) == GPIO_MODE_ANALOG)                   \
                                     )                                                    \
                                     ||                                                   \
                                     (IS_GPIO_EXTI1_EVT(__MODE__))                        \
                                     ||                                                   \
                                     (IS_GPIO_EXTI2_EVT(__MODE__))                        \
                                   )


#define IS_GPIO_SPEED(__SPEED__)    ( \
                                      ((__SPEED__) == GPIO_SPEED_FREQ_LOW)           ||   \
                                      ((__SPEED__) == GPIO_SPEED_FREQ_MEDIUM)        ||   \
                                      ((__SPEED__) == GPIO_SPEED_FREQ_HIGH)          ||   \
                                      ((__SPEED__) == GPIO_SPEED_FREQ_VERY_HIGH)          \
                                    )

#define IS_GPIO_PULL(__PULL__)      ( \
                                      ((__PULL__) == GPIO_NOPULL)                    ||   \
                                      ((__PULL__) == GPIO_PULLUP)                    ||   \
                                      ((__PULL__) == GPIO_PULLDOWN)                       \
                                    )

#if defined (CORTEX_IN_SECURE_STATE)
#define IS_GPIO_PIN_ATTRIBUTES(__ATTRIBUTES__)  ( \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_CID_SHARED_SELECT) ==    \
                                                   GPIO_PIN_ATTR_CID_SHARED_SELECT                  )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_CID_STATIC_SELECT) ==    \
                                                   GPIO_PIN_ATTR_CID_STATIC_SELECT                  )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_CID_DISABLE           ) ==    \
                                                   GPIO_PIN_CID_DISABLE                             )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_SEC_SELECT       ) ==    \
                                                   GPIO_PIN_ATTR_SEC_SELECT                         )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_PRIV_SELECT      ) ==    \
                                                   GPIO_PIN_ATTR_PRIV_SELECT                        )       \
                                                )
#else   /* CORTEX_IN_SECURE_STATE */
#define IS_GPIO_PIN_ATTRIBUTES(__ATTRIBUTES__)  ( \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_CID_SHARED_SELECT) ==    \
                                                   GPIO_PIN_ATTR_CID_SHARED_SELECT                  )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_CID_STATIC_SELECT) ==    \
                                                   GPIO_PIN_ATTR_CID_STATIC_SELECT                  )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_CID_DISABLE           ) ==    \
                                                   GPIO_PIN_CID_DISABLE                             )       \
                                                  ||                                                        \
                                                  (((__ATTRIBUTES__)&GPIO_PIN_ATTR_PRIV_SELECT      ) ==    \
                                                   GPIO_PIN_ATTR_PRIV_SELECT                        )       \
                                                )
#endif  /* CORTEX_IN_SECURE_STATE */
/**
  * @}
  */

/* Include GPIO HAL Extended module */
#include "stm32mp2xx_hal_gpio_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_Exported_Functions GPIO Exported Functions
  *  @brief    GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  * @{
  */

/* Initialization and de-initialization functions *****************************/
void              HAL_GPIO_Init(GPIO_TypeDef  *GPIOx, const GPIO_InitTypeDef *GPIO_Init);
void              HAL_GPIO_DeInit(GPIO_TypeDef  *GPIOx, uint32_t GPIO_Pin);

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group2 IO operation functions
  *  @brief    IO operation functions
  * @{
  */

/* IO operation functions *****************************************************/
GPIO_PinState     HAL_GPIO_ReadPin(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
void              HAL_GPIO_WritePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState);
void              HAL_GPIO_WriteMultipleStatePin(GPIO_TypeDef *GPIOx, uint16_t PinReset, uint16_t PinSet);
void              HAL_GPIO_TogglePin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
HAL_StatusTypeDef HAL_GPIO_LockPin(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
#if !defined(CORE_CM0PLUS)
EXTI_TypeDef     *getUsedExti(const GPIO_TypeDef  *GPIOx, uint32_t pinPosition);
void              HAL_GPIO_EXTI1_IRQHandler(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI1_Rising_Callback(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI1_Falling_Callback(uint16_t GPIO_Pin);
#endif  /* CORE_CM0PLUS */
void              HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin);
void              HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin);

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group3 GPIO Attributes functions
  * @brief    GPIO Attributes functions
  * @{
  */
HAL_StatusTypeDef HAL_GPIO_ConfigPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes);
HAL_StatusTypeDef HAL_GPIO_GetConfigPinAttributes(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin,
                                                  uint32_t *pPinAttributes);
HAL_StatusTypeDef HAL_GPIO_TakePinSemaphore(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);
HAL_StatusTypeDef HAL_GPIO_ReleasePinSemaphore(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin);


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_GPIO_H */
